/**
 * ? Залишкові параметри - Residual parameters
 * Використовуючи синтаксис залишкових параметрів, доповни код функції add() так,
 * щоб вона приймала будь-яку кількість аргументів у параметр args і повертала їхню суму.
 */

// function add(...args) {
//   let total = 0;
//   for (const num of args) {
//     total += num;
//   }
//   return total;
// }

// console.log(add(1, 2, 3));

/**
 * ? Збір частини аргументів - Gathering some of the arguments
 * Функція addOverNum() приймає довільну кількість аргументів чисел.
 * Доповни код функції таким чином, щоб вона обчислювала суму тільки тих аргументів, які більші за задане число.
 * Це число завжди буде передано першим аргументом.
 * Для вирішення цього завдання тобі потрібно зробити наступне:
 * Перший параметр value повинен представляти задане число, а решта аргументів повинні бути зібрані за допомогою синтаксису (...args)
 * Усередині функції ініціалізуй змінну для зберігання загальної суми
 * Потім пройдись по кожному аргументу за допомогою циклу
 * Перевір, чи кожен аргумент більший за вказане число, і якщо так, додай його до загальної суми
 * На завершення поверни загальну суму
 */

// function addOverNum(first, ...args) {
//   let sum = 0;
//   for (const num of args) {
//     if (first < num) {
//       sum += num;
//     }
//   }
//   return sum;
// }

// console.log(addOverNum(50, 15, 27)); // 0
// console.log(addOverNum(10, 12, 4, 11, 48, 10, 8)); // 71
